OdDAI.GlobalRule.appendWhereRule(OdDAI.WhereRule*)
\details
Append Where Rule to the Named Type.
\param ruleDef [in] Smart pointer to rule definition.

OdDAI.GlobalRule.expression
\details
Retrieves an expression of the Global Rule object.
\returns An ANSI string that contains the expression of the Global Rule object.

OdDAI.GlobalRule.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns An OdRxValue object that contains the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.GlobalRule.name
\details
Retrieves the name of the Global Rule object.
\returns An ANSI string that contains the Global Rule name.

OdDAI.GlobalRule.Dispose
\details
Destroys the Global Rule object.

OdDAI.GlobalRule
\details
The class represents functionality for a Global Rule for a model validation purposes.